#+title: The Wire-Cell Workstation Cluster
#+setupfile: wcwc-setup.org

* meta :noexport:

#+begin_src elisp :results none
(setenv "PATH" (concat (getenv "PATH") ":" (expand-file-name "../scripts")))
#+end_src

#+begin_src sh :results output drawer
scp wcwc.html wcwc.pdf hierocles.phy.bnl.gov:public_html/wire-cell/docs/
#+end_src

#+RESULTS:
:results:
:end:

** Introduction of Spack and ~wcwc~
:PROPERTIES:
:CUSTOM_ID: intro-spack-wcwc
:END:

The large software stacks for various projects and experiments are installed by the WCWC admin via Spack and made available to each WCWC workstation under the ~/wcwc~ directory.

Spack is a system used throughout HEP and other scientific communities to build and manage software ecosystems that may evolve over time to grow very large, spanning multiple suites comprised of many packages distinguished by different versions, build variants, compilers and hardware architectures.

A WCWC user may interact with this software directly via the ~spack~ command.  However, the ~wcwc~ command provides a simple interface to the most common tasks.  To get started with ~wcwc~ the user is encouraged to become familiar with its command-line help.  The main "page" of which can be viewed by running the command with no arguments:

#+begin_example
$ wcwc
#+end_example

#+begin_src sh :exports results :results output :wrap example
wcwc
#+end_src

#+RESULTS:
#+begin_example
Usage: wcwc [OPTIONS] COMMAND [ARGS]...

  Operate on the WCWC software ecosystem.

Options:
  -L, --log-level TEXT     set logging level [default:info]
  -l, --log-output TEXT    log to a file [default:stdout]
  -I, --image TEXT         Name podman image in which to run,
                           no/off/disable/none to run directly or
                           yes/on/enable for "wcwc-builder", default=off
  -P, --image-prefix TEXT  Specify WCWC Spack installation prefix inside
                           container (def=/wcwc)
  -p, --prefix TEXT        Specify WCWC Spack installation prefix (def=/wcwc)
  -c, --config TEXT        Specify a config file
  -h, --help               Show this message and exit.

Commands:
  admin    Commands to modify the WCWC installation.
  env      Create a Spack Environment in a directory.
  envs     List the defined system/shared environments.
  find     Find matching installed package instances.
  list     List matching package names (not instances).
  scopes   List known scopes
  shell    Produce a configured shell environment.
  show     Show information about a stack.
  spack    A wrapper around spack for WCWC admins.
  spec     Wrapper around spack spec.
  stacks   Show status about existence of known stacks.
  version  Print WCWC version
#+end_example


#+begin_note
If the above does not reflect what ~wcwc~ shows for you, then this document needs regenerating.
#+end_note

The top-level options related to "image" control running the ~wcwc~ command inside a podman container.  This is primarily meant for expert users and WCWC admins.  More information on this feature is in section [[#podman-images]].  Similarly, the ~admin~ group of commands are intended for use by WCWC admins and may be ignored by users.

Each command has its own help "page" which an be viewed like:
#+begin_example
$ wcwc <command> --help
#+end_example

The remainder of this section describes how to use ~wcwc~ for common tasks that "end users" may require.  Subsequently in sections [[#devel]] and [[#admin]] we describe how to use ~wcwc~ for developers and cluster administrators, respectively.

** Shell environment
:PROPERTIES:
:CUSTOM_ID: wcwc-shell
:END:


To use software built by Spack, the user shell environment requires some settings.  The ~wcwc shell~ command provides a number of ways to achieve this.

#+begin_example
$ wcwc shell --help
#+end_example

#+begin_src sh :exports results :results output :wrap example
wcwc shell --help
#+end_src

#+RESULTS:
#+begin_example
Usage: wcwc shell [OPTIONS]

  Produce a configured shell environment.

  This is a user command.  WCWC admins should avoid using this to modify the
  WCWC installation.  Instead use command in the "wcwc admin" group.

  This command supports a "cross product" of behavior along these dimensions:

  - the shell flavor (fish, sh-like and csh-like)

  - the mode of supplying the target environment (settings, command or shell)

  - the make up of the target environment (base, load modules, activate
  environment)

Options:
  -S, --stacks TEXT               Comma-separated list of stack names, if
                                  needed to resolve environment
  -s, --shell [sh|bash|dash|zsh|fish|csh|tcsh|auto]
                                  Set the shell flavor, default:auto
  -o, --output TEXT               Emit shell settings to given output, "-" or
                                  "stdout" for emitting to standard output
  -c, --command TEXT              Execute the command in a configured shell
  -e, --environment TEXT          Use given Spack Environment to determine
                                  shell settings
  -l, --load TEXT                 Load the given package spec
  -k, --keep                      Retain settings file and emit its name
                                  (ignored for -o/--output)
  -h, --help                      Show this message and exit.
#+end_example

As introduced in the help page, there are three basic /modes/ employed in use of ~wcwc shell~:

- subshell :: Execute a configured sub-shell for interactive use (default).
- command :: Run a single command in a configured environment (give ~-c/--command~ option).
- mutate :: Modify the currently running shell with environment settings (get ~-o/--output~ option).

With *subshell* one gets a properly configured interactive shell to use.  When done, simply ~exit~ to return to the calling shell, which has remained unchanged.  With *command*, a single command is run and when complete the user is again returned to their previous and unchanged shell session.  On the other hand, the *mutate* mode will emit shell environment settings intended to modify an existing shell.  This should be used with caution as there is no "undo" (in general) and the user must ~exit~ the *original* shell to escape the mutations.

Regardless of /mode/ the environment is modified according to specified loading of "environment modules" (~-l/--load~) and/or activating a Spack Environment (~-e/--environment~).  In addition, the shell to assume is detected automatically but can be forced with ~-s/--shell~.  Furthermore, zero or more software "stacks" can be named to provide access to more or less of the ecosystem.

The following sub sections give examples of use of ~wcwc shell~.

** Spack View for development

The kernel of a Spack Environment is a Spack View.  It may be used to create a simpler developer environment.  The user may supply the environment settings or optionally a [[https://direnv.net/][direnv]] ~.envrc~ file can be initialized to supply basic shell environment settings.  To create the view:

The ~view~ command help page:
#+begin_example
$ wcwc view --help
#+end_example

#+begin_src sh :exports results :results output :wrap example
wcwc view --help
#+end_src

#+RESULTS:
#+begin_example
Usage: wcwc view [OPTIONS] VIEW

  Create a view directory given one or more seed specs.

Options:
  -S, --stacks TEXT   Set stacks to use as comma separated list
  -e, --exclude TEXT  Exclude a spec from the view. Special 'seeds' excludes
                      the seeds
  -d, --direnv TEXT   Initialize a direnv .envrc in the given directory
  -s, --seed TEXT     Supply a seed spec.
  -f, --force         Force (re)making the view
  -h, --help          Show this message and exit.
#+end_example

The use of ~-d/--direnv=/path~ means that with a direnv-enabled shell, ~cd~'ing to that ~/path~ will cause your shell to be configured to use the view.  This includes a Python virtual so that any ~pip install~ or ~python setup.py install~ commands install into the view directory.
For a worked example, see [[file:wcwc-howto.org::#spack-view-wct]].

